#!/usr/bin/env python
# -*- coding:utf-8 -*-

# 数据库
    # 很多功能如果只是通过操作文件来改变数据是非常繁琐的
        # 程序员需要做很多事情
    # 对于多台机器或者多个进程操作用一份数据
        # 程序员自己解决并发和安全问题比较麻烦
    # 自己处理一些数据备份，容错的措施

# C/S架构的 操作数据文件的一个管理软件
    # 1.帮助我们解决并发问题
    # 2.能够帮助我们用更简单更快速的方式完成数据的增删改查
    # 3.能够给我们提供一些容错、高可用的机制
    # 4.权限的认证

# 数据库管理系统 —— 专门用来管理数据文件，帮助用户更简洁的操作数据的软件
    # DBMS
# 数据 data
# 文件
# 文件夹 -- 数据库database db
# 数据库管理员 —— DBA

# 数据库管理系统
    # 关系型数据库
        # sql server
        # oracle 收费、比较严谨、安全性比较高
            # 国企 事业单位
            # 银行 金融行业
        # mysql  开源的
            # 小公司
            # 互联网公司
        # sqllite
    # 非关系型数据库
        # redis
        # mongodb

# 






