#!/usr/bin/env python
# -*- coding:utf-8 -*-

# bytes  str
# utf-8 和gbk有什么关系？

# "我是好人" --> 字节
# 计算机上的存储 / 网线上数据的传输 --> 二进制
# 1  位 bit 比特
# 10101100  8位1个字节

# s21编码  s22编码  utf8编码  gbk编码
# 1->我     10->我
# 2->是     11->是
# 3->好
# 4->人

# 1234
# 00000001000000100000001100000100 --->  1234(我是好人)
#
# 10111213
# 00001010000010110000110000001101 --->  00001010000010110000110000001101 ->10111213(我是好人)

# send
# str-encode(编码)->bytes

# recv
# bytes-decode(编码)-> str





# bytes  str
# utf-8 和gbk有什么关系？

# "我是好人" --> 字节
# 计算机上的存储 / 网线上数据的传输 --> 二进制
# 1  位 bit 比特
# 10101100  8位1个字节

# s21编码  s22编码  utf8编码  gbk编码
# 1->我     10->我
# 2->是     11->是
# 3->好
# 4->人

# 1234
# 00000001000000100000001100000100 --->  1234(我是好人)
#
# 10111213
# 00001010000010110000110000001101 --->  00001010000010110000110000001101 ->10111213(我是好人)

# send
# str-encode(编码)->bytes

# recv
# bytes-decode(编码)-> str






# bytes  str
# utf-8 和gbk有什么关系？

# "我是好人" --> 字节
# 计算机上的存储 / 网线上数据的传输 --> 二进制
# 1  位 bit 比特
# 10101100  8位1个字节

# s21编码  s22编码  utf8编码  gbk编码
# 1->我     10->我
# 2->是     11->是
# 3->好
# 4->人

# 1234
# 00000001000000100000001100000100 --->  1234(我是好人)
#
# 10111213
# 00001010000010110000110000001101 --->  00001010000010110000110000001101 ->10111213(我是好人)

# send
# str-encode(编码)->bytes

# recv
# bytes-decode(编码)-> str






# bytes  str
# utf-8 和gbk有什么关系？

# "我是好人" --> 字节
# 计算机上的存储 / 网线上数据的传输 --> 二进制
# 1  位 bit 比特
# 10101100  8位1个字节

# s21编码  s22编码  utf8编码  gbk编码
# 1->我     10->我
# 2->是     11->是
# 3->好
# 4->人

# 1234
# 00000001000000100000001100000100 --->  1234(我是好人)
#
# 10111213
# 00001010000010110000110000001101 --->  00001010000010110000110000001101 ->10111213(我是好人)

# send
# str-encode(编码)->bytes

# recv
# bytes-decode(编码)-> str

